#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.repository_nuxt_web["services-scanner"].github_branch.branch["main"] will be created
  + resource "github_branch" "branch" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "web-services-scanner"
      + sha           = (known after apply)
      + source_branch = "develop"
      + source_sha    = (known after apply)
    }

  # module.repository_nuxt_web["services-scanner"].github_branch_default.default will be created
  + resource "github_branch_default" "default" {
      + branch     = "develop"
      + id         = (known after apply)
      + rename     = false
      + repository = "web-services-scanner"
    }

  # module.repository_nuxt_web["services-scanner"].github_branch_protection.all["*"] will be created
  + resource "github_branch_protection" "all" {
      + allows_deletions                = true
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "web-services-scanner"
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # module.repository_nuxt_web["services-scanner"].github_branch_protection.all["**/**"] will be created
  + resource "github_branch_protection" "all" {
      + allows_deletions                = true
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "**/**"
      + repository_id                   = "web-services-scanner"
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # module.repository_nuxt_web["services-scanner"].github_branch_protection.protection["develop"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "develop"
      + repository_id                   = "web-services-scanner"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_nuxt_web["services-scanner"].github_branch_protection.protection["main"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "web-services-scanner"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_nuxt_web["services-scanner"].github_repository.repository will be created
  + resource "github_repository" "repository" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = false
      + allow_squash_merge          = false
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Arrow Web Application - Tag Scanner for Parcel & Customer Tracking"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "web-services-scanner"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = true

      + security_and_analysis {
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "disabled"
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "Arrow-air"
          + repository           = "web-template-nuxt"
        }
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files[".commitlintrc.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ---
            ## DO NOT EDIT!
            ## This file was provisioned by Terraform
            ## File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.commitlintrc.yml
            
            rules:
              body-leading-blank: [1, always]
              body-max-line-length: [2, always, 100]
              footer-leading-blank: [1, always]
              footer-max-line-length: [2, always, 100]
              header-max-length: [2, always, 100]
              subject-case:
                - 2
                - never
                - [sentence-case, start-case, pascal-case, upper-case]
              subject-empty: [2, never]
              subject-full-stop: [2, never, "."]
              type-case: [2, always, lower-case]
              type-empty: [2, never]
              type-enum:
                - 2
                - always
                - [build, chore, ci, docs, feat, fix, perf, refactor, revert, style, test]
        EOT
      + file                = ".commitlintrc.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-scanner"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files[".cspell.config.yaml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ---
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.cspell.config.yaml
            
            $schema: https://raw.githubusercontent.com/streetsidesoftware/cspell/main/cspell.schema.json
            version: "0.2"
            language: "en"
            dictionaryDefinitions:
              - name: project-words
                path: "./.cspell.project-words.txt"
                addWords: true
            dictionaries: ["project-words"]
            ignoreRegExp:
              - '\..*'
            ignorePaths:
              - "node_modules"
              - "build"
              - "*.css"
              - "*.svg"
              - "*/**Makefile"
              - "target"
              - "logs"
              - "out"
              - "coverage"
              - "src/*.plan"
        EOT
      + file                = ".cspell.config.yaml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-scanner"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files[".editorconfig"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.editorconfig
            root = true
            [*]
            end_of_line = lf
            charset = utf-8
            trim_trailing_whitespace = true
            insert_final_newline = true
            indent_style = space
            indent_size = 4
            [{*.md,*.mdx,LICENSE*}]
            # double whitespace at end of line
            # denotes a line break in Markdown
            indent_size = off
            trim_trailing_whitespace = false
            [*.rs]
            trim_trailing_whitespace = false
            indent_style = space
            indent_size = 4
            [{Makefile*,*.mk,*.sh}]
            indent_style = tab
            indent_size = 4
            [{*.ts,*.tsx,*.html,*.yml,*.yaml,*.toml,*.json,*.tf,*.hcl}]
            indent_size = 2
            # we might want to use https://www.npmjs.com/package/lintspaces instead, we can't lint the css and js comments atm
            [{*.js,*.css,Cargo.lock}]
            indent_size = unset
        EOT
      + file                = ".editorconfig"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-scanner"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files[".github/CODEOWNERS"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            * @Arrow-air/webdevelopers
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-scanner"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files[".github/workflows/autosquash.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-all/.github/workflows/autosquash.yml
            
            name: Auto-squash
            
            on:
              pull_request:
                branches:
                  - 'develop'
                  - 'staging'
                  - 'main'
            
            permissions:
              contents: write
            
            jobs:
              autosquash:
                name: Autosquash
                runs-on: ubuntu-latest
                steps:
                  - name: Import Arrow bot's GPG key for signing commits
                    id: import-gpg
                    uses: crazy-max/ghaction-import-gpg@v5
                    with:
                      gpg_private_key: ${{ secrets.COMMITBOT_GPG_PRIVATE_KEY }}
                      passphrase: ${{ secrets.COMMITBOT_GPG_PASSPHRASE }}
                      git_config_global: true
                      git_user_signingkey: true
                      git_commit_gpgsign: true
                      git_tag_gpgsign: true
            
                  - name: Checkout Code
                    uses: actions/checkout@v3
                    with:
                      ref: ${{ github.head_ref }}
                      token: ${{ secrets.COMMITBOT_GITHUB_TOKEN }}
                      fetch-depth: 0
            
                  - name: Automatic Rebase Autosquash
                    run: |
                      git rebase -i --autosquash origin/${{ github.base_ref }}
                      git push -f
                    env:
                      GIT_AUTHOR_NAME: ${{ steps.import-gpg.outputs.name }}
                      GIT_AUTHOR_EMAIL: ${{ steps.import-gpg.outputs.email }}
                      GIT_COMMITTER_NAME: ${{ steps.import-gpg.outputs.name }}
                      GIT_COMMITTER_EMAIL: ${{ steps.import-gpg.outputs.email }}
                      # git rebase with auto squash will be a noop if not run in interactive mode.
                      # using ':' or 'true' as the sequence editor allows us to automatically apply the squash actions
                      # https://git-scm.com/docs/git-config#Documentation/git-config.txt-sequenceeditor
                      GIT_SEQUENCE_EDITOR: ':'
        EOT
      + file                = ".github/workflows/autosquash.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-scanner"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files[".github/workflows/build-and-deploy.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-web/.github/workflows/build-and-deploy.yml
            
            name: Build and deploy
            
            on:
              workflow_call:
                inputs:
                  node-version:
                    required: true
                    type: string
                    description: "The node version to use for node setup"
                  environment:
                    required: true
                    type: string
                    description: "Environment to deploy to"
            
            jobs:
              build-and-deploy:
                runs-on: ubuntu-latest
                timeout-minutes: 10
                environment: ${{ inputs.environment }}
                permissions:
                  id-token: write
                  contents: read
                env:
                  AWS_S3_BUCKET: s3-${{ vars.ENVIRONMENT_ABBR }}-${{ vars.APP }}.${{ vars.DOMAIN }}
                steps:
                  - name: Checkout
                    uses: actions/checkout@v2
                  - name: Set up node ${{ inputs.node-version }}
                    uses: actions/setup-node@v2
                    with:
                      node-version: ${{ inputs.node-version }}
                      cache: yarn
                  - name: Install dependencies
                    run: yarn install --frozen-lockfile
                  - name: Configure AWS Credentials
                    uses: aws-actions/configure-aws-credentials@v1
                    with:
                      role-to-assume: "arn:aws:iam::${{ secrets.AWS_ACCOUNT }}:role/${{ vars.ENVIRONMENT_ABBR }}-GitHubActionsWebsite"
                      role-session-name: "github-actions-${{ github.event.repository.name }}-deploy"
                      aws-region: "${{ vars.AWS_REGION }}"
                  - name: Build
                    run: yarn generate
                  - name: Deploy to ${{ inputs.environment }} S3
                    id: sync_s3
                    run: |
                      aws s3 sync "./dist/img/" "s3://${{ env.AWS_S3_BUCKET }}/img/" --delete --size-only
                      aws s3 sync "./dist/" "s3://${{ env.AWS_S3_BUCKET }}/" --exclude "./dist/img"
                outputs:
                  files_changed: "${{ steps.build-and-deploy.outputs.files_changed }}"
        EOT
      + file                = ".github/workflows/build-and-deploy.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-scanner"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files[".github/workflows/deploy-dmo.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-web/.github/workflows/deploy-dmo.yml
            
            name: Deploy Demo
            
            on:
              workflow_dispatch:
            
            jobs:
              build-and-deploy:
                uses: ./.github/workflows/build-and-deploy.yml
                with:
                  node-version: 19.x
                  environment: demo
                secrets: inherit
                permissions:
                  id-token: write
                  contents: read
        EOT
      + file                = ".github/workflows/deploy-dmo.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-scanner"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files[".github/workflows/deploy-prd.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            ## This file was provisioned by Terraform
            ## File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-web/.github/workflows/deploy-prd.yml
            
            name: Deploy Production
            
            on:
              push:
                branches:
                  - main
              workflow_dispatch:
            
            jobs:
              build-and-deploy:
                uses: ./.github/workflows/build-and-deploy.yml
                with:
                  node-version: 19.x
                  environment: production
                secrets: inherit
                permissions:
                  id-token: write
                  contents: read
            
              invalidate-cloudfront:
                uses: ./.github/workflows/invalidate-cloudfront.yml
                needs: [build-and-deploy]
                with:
                  paths: "/*"
                  environment: production
                secrets: inherit
                permissions:
                  id-token: write
                  contents: read
        EOT
      + file                = ".github/workflows/deploy-prd.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-scanner"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files[".github/workflows/deploy-stg.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-web/.github/workflows/deploy-stg.yml
            
            name: Deploy Staging
            
            on:
              push:
                branches:
                  - staging
              workflow_dispatch:
            
            jobs:
              build-and-deploy:
                uses: ./.github/workflows/build-and-deploy.yml
                with:
                  node-version: 19.x
                  environment: staging
                secrets: inherit
                permissions:
                  id-token: write
                  contents: read
            
              invalidate-cloudfront:
                uses: ./.github/workflows/invalidate-cloudfront.yml
                needs: [build-and-deploy]
                with:
                  paths: "/*"
                  environment: staging
                secrets: inherit
                permissions:
                  id-token: write
                  contents: read
        EOT
      + file                = ".github/workflows/deploy-stg.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-scanner"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files[".github/workflows/invalidate-cloudfront.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-web/.github/workflows/invalidate-cloudfront.yml
            
            name: Create cloudfront invalidation
            
            on:
              workflow_call:
                inputs:
                  environment:
                    required: true
                    type: string
                    description: "Environment to deploy to"
                  paths:
                    required: true
                    type: string
                    description: "Paths to invalidate"
            
            jobs:
              aws-cloudfront:
                runs-on: ubuntu-latest
                timeout-minutes: 10
                environment: ${{ inputs.environment }}
                permissions:
                  id-token: write
                  contents: read
                steps:
                  - name: Configure AWS Credentials
                    uses: aws-actions/configure-aws-credentials@v1
                    with:
                      role-to-assume: "arn:aws:iam::${{ secrets.AWS_ACCOUNT }}:role/${{ vars.ENVIRONMENT_ABBR }}-GitHubActionsWebsite"
                      role-session-name: "github-actions-${{ github.event.repository.name }}-cf-invalidate"
                      aws-region: "${{ vars.AWS_REGION }}"
                  - name: Create Invalidation
                    run: |
                      aws cloudfront create-invalidation --distribution-id "${{ vars.AWS_CLOUDFRONT_DISTRIBUTION }}" --paths "${{ inputs.paths }}"
        EOT
      + file                = ".github/workflows/invalidate-cloudfront.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-scanner"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files[".github/workflows/sanity_checks.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/sanity_checks.yml
            
            name: Sanity checks
            
            env:
              TERM: xterm
            
            on:
              pull_request:
                branches:
                  - develop
                  - main
            
            jobs:
              codestyle:
                name: Code Style Check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make editorconfig-test
            
              cspell:
                name: Spelling Check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make cspell-test
            
              md-test:
                name: Markdown Broken Link Checker
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make md-test-links
            
              commit-msg:
                name: Commit message Check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      fetch-depth: 0
                  - run: npx commitlint --from=${{ github.event.pull_request.base.sha }}
            
              release-notes:
                name: Preview Release Notes
                runs-on: ubuntu-latest
                steps:
                  - name: Checkout Code
                    uses: actions/checkout@v3
                    with:
                      fetch-depth: 0
            
                  - name: Generate Changelog
                    id: changelog
                    uses: mrchief/universal-changelog-action@v1.3.1
                    with:
                      previousReleaseTagNameOrSha: ${{ github.event.pull_request.base.sha }}
                      nextReleaseTagName: ${{ github.sha }}
                      nextReleaseName: "Release ${{ steps.tag_version.outputs.new_version }}"
            
                  - name: Add PR Comment with Changelog Output
                    uses: thollander/actions-comment-pull-request@v1
                    continue-on-error: true
                    with:
                      message: |
                        <details>
                        <summary>This PR will generate the following release notes when merged:</summary>
            
                        ${{ steps.changelog.outputs.changelog }}
            
                        </details>
                      comment_includes: 'This PR will generate the following release notes when merged'
        EOT
      + file                = ".github/workflows/sanity_checks.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-scanner"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files[".gitignore"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-all/.gitignore
            
            # Dependencies
            node_modules
            
            # Nuxt build and generate output dirs
            .nuxt
            .output
            dist
            
            # Logs
            npm-debug.log*
            yarn-debug.log*
            yarn-error.log*
            
            # Don't add vscode or idea meta files
            .vscode
            .idea
            
            # Don't add DS_Store
            .DS_Store
            
            # env
            .env
        EOT
      + file                = ".gitignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-scanner"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files[".husky/commit-msg"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #!/bin/sh
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-all/.husky/hooks/commit-msg
            . "$(dirname -- "$0")/_/husky.sh"
            
            export COMMITLINT_CHECK=${1}
            make commitlint-test
        EOT
      + file                = ".husky/commit-msg"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-scanner"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files[".husky/pre-commit"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #!/bin/sh
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-all/.husky/hooks/pre-commit
            . "$(dirname -- "$0")/_/husky.sh"
            
            # Style templates for console output.
            GREEN=$(tput setaf 2)
            YELLOW=$(tput setaf 3)
            NC=$(tput setaf 9)
            BOLD=$(tput bold)
            SGR0=$(tput sgr0)
            
            echo -e "${BOLD}${YELLOW}Running the pre-commit hook...${NC}${SGR0}"
            
            set -e
            
            # Tests
            make test
            
            # Finish
            echo "${BOLD}${GREEN}🍺 You are good to go!${NC}${SGR0}"
        EOT
      + file                = ".husky/pre-commit"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-scanner"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files[".make/base.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/base.mk
            
            SHELL := /bin/bash
            
            SANITYCHECKS_IMAGE_NAME := ghcr.io/arrow-air/tools/arrow-sanitychecks
            SANITYCHECKS_IMAGE_TAG  := 0.2
            
            SOURCE_PATH      ?= $(PWD)
            
            # Style templates for console output.
            GREEN  := $(shell echo -e `tput setaf 2`)
            YELLOW := $(shell echo -e `tput setaf 3`)
            CYAN   := $(shell echo -e `tput setaf 6`)
            BOLD   := $(shell echo -e `tput bold`)
            SMUL   := $(shell echo -e `tput smul`)
            SGR0   := $(shell echo -e `tput sgr0`)
            
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional flags (optional)
            docker_run = docker run \
            	--name=$(DOCKER_NAME)-$@ \
            	--rm \
            	--user `id -u`:`id -g` \
            	--workdir=/usr/src/app \
            	-v "$(SOURCE_PATH)/:/usr/src/app" \
            	$(2) \
            	-t $(SANITYCHECKS_IMAGE_NAME):$(SANITYCHECKS_IMAGE_TAG) \
            	$(1)
            
            .SILENT: *docker-pull
            
            .help-base:
            	@echo ""
            	@echo "$(BOLD)$(CYAN)Available targets$(SGR0)"
            
            docker-pull:
            	@echo docker pull -q $(SANITYCHECKS_IMAGE_NAME):$(SANITYCHECKS_IMAGE_TAG)
        EOT
      + file                = ".make/base.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-scanner"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files[".make/commitlint.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/commitlint.mk
            
            COMMITLINT_CHECK :=
            
            .help-commitlint:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Commitlint$(SGR0)"
            	@echo "  $(BOLD)commitlint-test$(SGR0)  -- Run 'commitlint --edit $(COMMITLINT_CHECK)'"
            	@echo "                      to validate commit messages are following the conventional commit standards."
            
            commitlint-test: docker-pull
            	@echo "$(CYAN)Checking for commit message errors...$(SGR0)"
            	@$(call docker_run,commitlint --edit $(COMMITLINT_CHECK))
        EOT
      + file                = ".make/commitlint.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-scanner"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files[".make/cspell.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/cspell.mk
            CSPELL_PROJECT_WORDS ?= .cspell.project-words.txt
            
            .help-cspell:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)CSpell$(SGR0)"
            	@echo "  $(BOLD)cspell-test$(SGR0)      -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml'"
            	@echo "                      to validate files are not containing any spelling errors."
            	@echo "  $(BOLD)cspell-add-words$(SGR0) -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml | "
            	@echo "                      sort --ignore-case >> .cspell.project-words.txt'"
            	@echo "                      to add remaining words to the project's cspell ignore list"
            
            cspell-test: docker-pull
            ifeq ("$(wildcard $(CSPELL_PROJECT_WORDS))","")
            	@echo "$(YELLOW)No $(CSPELL_PROJECT_WORDS) found, creating...$(SGR0)"
            	touch $(CSPELL_PROJECT_WORDS)
            endif
            	@echo "$(CYAN)Checking for spelling errors...$(SGR0)"
            	@$(call docker_run,cspell --words-only --unique "**/**" -c .cspell.config.yaml)
            
            cspell-add-words: docker-pull
            	@echo "$(CYAN)Adding words to the project's cspell word list...$(SGR0)"
            	@$(call docker_run,sh -c 'cspell --words-only --unique "**/**" -c .cspell.config.yaml 2> /dev/null | sort -f >> .cspell.project-words.txt')
        EOT
      + file                = ".make/cspell.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-scanner"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files[".make/editorconfig.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/editorconfig.mk
            
            .help-editorconfig:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Editorconfig$(SGR0)"
            	@echo "  $(BOLD)editorconfig-test$(SGR0) -- Run editorconfig test to validate all file formats are valid"
            	@echo "  $(BOLD)editorconfig-tidy$(SGR0) -- Run editorconfig tidy to fix all file formats if needed"
            
            editorconfig-test:
            	@echo "$(CYAN)Checking if the codebase is compliant with the .editorconfig file...$(SGR0)"
            	@docker run \
            		--name=$(DOCKER_NAME)-$@ \
            		--rm \
            		--user `id -u`:`id -g` \
            		-w "/usr/src/app" \
            		-v "$(PWD):/usr/src/app" \
            		-t mstruebing/editorconfig-checker
            
            editorconfig-tidy: docker-pull
            	@echo "$(CYAN)Running editorconfig formatting fixes...$(SGR0)"
            	@$(call docker_run,sh -c 'eclint fix .')
        EOT
      + file                = ".make/editorconfig.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-scanner"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files[".make/markdown.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/markdown.mk
            
            MARKDOWN_FILES ?= $(shell find . -type f -iname '*md' ! -iwholename "*./node_modules/*" ! -path "./build" ! -iwholename "*.terraform*" ! -iwholename "*.cargo/*" ! -iwholename "./target/*")
            LINK_CHECKER_JSON ?= .link-checker.config.json
            
            .help-markdown:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Markdown$(SGR0)"
            	@echo "  $(BOLD)md-test-links$(SGR0)   -- Run markdown-link-check on all markdown files to catch dead links."
            
            md-test-links:
            ifeq ("$(MARKDOWN_FILES)", "")
            	@echo "$(YELLOW)No markdown files found, skipping link validation...$(SGR0)"
            else
            ifeq ("$(wildcard $(LINK_CHECKER_JSON))","")
            	@echo "$(YELLOW)No $(LINK_CHECKER_JSON) found, creating...$(SGR0)"
            	echo -e "{\n}\n" > $(LINK_CHECKER_JSON)
            endif
            	@echo "$(CYAN)Checking if all document links are valid...$(SGR0)"
            	@docker run \
            		--name=$(DOCKER_NAME)-$@ \
            		--rm \
            		--user `id -u`:`id -g` \
            		-w "/usr/src/app" \
            		-v "$(PWD):/usr/src/app" \
            		-t ghcr.io/tcort/markdown-link-check:3.10 \
            		-c $(LINK_CHECKER_JSON) $(MARKDOWN_FILES)
            endif
        EOT
      + file                = ".make/markdown.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-scanner"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files[".prettierrc.yaml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            editorconfig: true
            overrides:
              - files: "**/*.vue"
                options:
                  parser: vue
                  vueIndentScriptAndStyle: true
              - files:
                  - "**/*.scss"
                  - "**/*.css"
                  - "**/*.js"
                options:
                  singleQuote: true
        EOT
      + file                = ".prettierrc.yaml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-scanner"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files["CONTRIBUTING.md"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            See [Contributing Guide](https://www.arrowair.com/docs/contributing/intro)  on Arrow website.
        EOT
      + file                = "CONTRIBUTING.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-scanner"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.files["Makefile"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/nuxt-all/Makefile
            
            DOCKER_NAME := arrow-web-services-scanner
            
            help: .help-base .help-cspell .help-markdown .help-editorconfig .help-commitlint
            
            include .make/base.mk
            include .make/cspell.mk
            include .make/markdown.mk
            include .make/editorconfig.mk
            include .make/commitlint.mk
            
            test: cspell-test md-test-links editorconfig-test
        EOT
      + file                = "Makefile"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-scanner"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_file.init will be created
  + resource "github_repository_file" "init" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            DO NOT REMOVE
            This repository is managed by Terraform and contains files that will be overwritten when changed
            This file is part of the management of repository web-services-scanner
        EOT
      + file                = ".terraform_init"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "web-services-scanner"
      + sha                 = (known after apply)
    }

  # module.repository_nuxt_web["services-scanner"].github_repository_webhook.map["discord"] will be created
  + resource "github_repository_webhook" "map" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "pull_request",
          + "pull_request_review",
          + "pull_request_review_comment",
          + "pull_request_review_thread",
        ]
      + id         = (known after apply)
      + repository = "web-services-scanner"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # module.repository_nuxt_web["services-scanner"].github_team_repository.maintainer["webdevelopers"] will be created
  + resource "github_team_repository" "maintainer" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "web-services-scanner"
      + team_id    = "webdevelopers"
    }

  # module.repository_rust_lib["router"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9o84Bqidv"
        # (11 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              - "U_kgDOB0oVlw",
              + "/arrow-github-bot",
                # (1 unchanged element hidden)
            ]
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository_rust_lib["router"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHyi9o84Bqid1"
        # (11 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              - "U_kgDOB0oVlw",
              + "/arrow-github-bot",
                # (1 unchanged element hidden)
            ]
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 32 to add, 2 to change, 0 to destroy.

```

</details>

*Pusher: @ServiceDog, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*